In [18]:
!pip install Kmodes

Collecting Kmodes
  Downloading kmodes-0.11.1-py2.py3-none-any.whl (19 kB)
Requirement already satisfied: numpy>=1.10.4 in /usr/local/lib/python3.7/dist-packages (from Kmodes) (1.19.5)
Requirement already satisfied: scipy>=0.13.3 in /usr/local/lib/python3.7/dist-packages (from Kmodes) (1.4.1)
Requirement already satisfied: scikit-learn>=0.22.0 in /usr/local/lib/python3.7/dist-packages (from Kmodes) (1.0.1)
Requirement already satisfied: joblib>=0.11 in /usr/local/lib/python3.7/dist-packages (from Kmodes) (1.1.0)
Requirement already satisfied: threadpoolctl>=2.0.0 in /usr/local/lib/python3.7/dist-packages (from scikit-learn>=0.22.0->Kmodes) (3.0.0)
Installing collected packages: Kmodes
Successfully installed Kmodes-0.11.1

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
bank = pd.read_csv("bankmarketing.csv")

In [3]:
bank.head()

   age        job  marital  ... euribor3m nr.employed   y
0   56  housemaid  married  ...     4.857      5191.0  no
1   57   services  married  ...     4.857      5191.0  no
2   37   services  married  ...     4.857      5191.0  no
3   40     admin.  married  ...     4.857      5191.0  no
4   56   services  married  ...     4.857      5191.0  no

[5 rows x 21 columns]

In [4]:
bank.columns

Index(['age', 'job', 'marital', 'education', 'default', 'housing', 'loan',
       'contact', 'month', 'day_of_week', 'duration', 'campaign', 'pdays',
       'previous', 'poutcome', 'emp.var.rate', 'cons.price.idx',
       'cons.conf.idx', 'euribor3m', 'nr.employed', 'y'],
      dtype='object')

In [6]:
bank_new = bank[['age','job', 'marital', 'education', 'default', 'housing', 'loan','contact','month','day_of_week','poutcome']]

In [8]:
bank_new.head()

   age        job  marital  ... month day_of_week     poutcome
0   56  housemaid  married  ...   may         mon  nonexistent
1   57   services  married  ...   may         mon  nonexistent
2   37   services  married  ...   may         mon  nonexistent
3   40     admin.  married  ...   may         mon  nonexistent
4   56   services  married  ...   may         mon  nonexistent

[5 rows x 11 columns]

In [9]:
bank_new['age_bin'] = pd.cut(bank_new['age'], [0, 20, 30, 40, 50, 60, 70, 80, 90, 100], 
                              labels=['0-20', '20-30', '30-40', '40-50','50-60','60-70','70-80', '80-90','90-100'])
bank_new  = bank_new.drop('age',axis = 1)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [10]:
bank_new.head()

         job  marital    education  ... day_of_week     poutcome age_bin
0  housemaid  married     basic.4y  ...         mon  nonexistent   50-60
1   services  married  high.school  ...         mon  nonexistent   50-60
2   services  married  high.school  ...         mon  nonexistent   30-40
3     admin.  married     basic.6y  ...         mon  nonexistent   30-40
4   services  married  high.school  ...         mon  nonexistent   50-60

[5 rows x 11 columns]

In [11]:
bank_new.shape

(41188, 11)

In [12]:
bank_new.describe()

           job  marital          education  ... day_of_week     poutcome age_bin
count    41188    41188              41188  ...       41188        41188   41188
unique      12        4                  8  ...           5            3       9
top     admin.  married  university.degree  ...         thu  nonexistent   30-40
freq     10422    24928              12168  ...        8623        35563   16385

[4 rows x 11 columns]

In [13]:
bank_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41188 entries, 0 to 41187
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   job          41188 non-null  object
 1   marital      41188 non-null  object
 2   education    41188 non-null  object
 3   default      41188 non-null  object
 4   housing      41188 non-null  object
 5   loan         41188 non-null  object
 6   contact      41188 non-null  object
 7   month        41188 non-null  object
 8   day_of_week  41188 non-null  object
 9   poutcome     41188 non-null  object
 10  age_bin      41188 non-null  category
dtypes: category(1), object(10)
memory usage: 3.2+ MB

In [14]:
bank_new.isnull().sum()

job            0
marital        0
education      0
default        0
housing        0
loan           0
contact        0
month          0
day_of_week    0
poutcome       0
age_bin        0
dtype: int64

In [15]:
bank_new_copy = bank_new.copy()

In [16]:
from sklearn import preprocessing
le = preprocessing.LabelEncoder()
bank_new = bank_new.apply(le.fit_transform)
bank_new.head()

   job  marital  education  default  ...  month  day_of_week  poutcome  age_bin
0    3        1          0        0  ...      6            1         1        4
1    7        1          3        1  ...      6            1         1        4
2    7        1          3        0  ...      6            1         1        2
3    0        1          1        0  ...      6            1         1        2
4    7        1          3        0  ...      6            1         1        4

[5 rows x 11 columns]

In [19]:
from kmodes.kmodes import KModes

In [21]:
km = KModes(n_clusters=2, verbose=1)
fitClusters = km.fit_predict(bank_new)

Init: initializing centroids
Init: initializing clusters
Starting iterations...
Run 1, iteration: 1/100, moves: 5322, cost: 192203.0
Run 1, iteration: 2/100, moves: 1160, cost: 192203.0

In [22]:
fitClusters

array([1, 1, 0, ..., 0, 1, 0], dtype=uint16)

In [23]:
clusterCentroidsDf = pd.DataFrame(km.cluster_centroids_)
clusterCentroidsDf.columns = bank_new.columns

In [24]:
clusterCentroidsDf

   job  marital  education  default  ...  month  day_of_week  poutcome  age_bin
0    0        1          6        0  ...      6            2         1        2
1    1        1          3        0  ...      6            0         1        3

[2 rows x 11 columns]